# Müller Alexader
# \033[0;__;__m \033[m   or   \033[1;__;__m \033[m
# print('#' * 115)      # Для разделения блоков на листе с кодом:
""" ################################################################################################################
 21.05.25
 AI  &  Python 5: Экосистема LangChain и PromptHub. Агентный подход в разработке с использованием LLM.
 GitHub Course: https://github.com/viacheslav-bandylo/llm-course/tree/main
 ################################################################################################################### """

# ------------------------ SHORTCUTS ------------------------
# Ctrl + W - выделить текущий блок. если нажимать это сочетание дальше, то будут выделяться родительские блоки.
# Ctrl+Y - Удаление всей строки. Кстати, команда копирования Ctrl+C без выделения также работает для всей строки.
# Ctrl+Akt+L / Alt+Enter - Привести код к принятым стандартам (для Python - PEP8).
# Ctrl+R — Изменить название класса/функции и т. п. по всему проекту.
# Ctrl+Shift + F - Найти по всем файлам.
# Shift + F6 - заменить имя элемента во всех частях во всех файлах.
# -----------------------------------------------------------

print('.' * 80)


"""" %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%_____________   LangChain:       ____________%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% 
                                                Введение и основы                                                  """

# Сначала установить библиотеку LangChain через команду в консоли:
# pip install LangChain
# pip install langchain_google_genai
# pip install langchain_core
# pip install langchain_community

""" __________ Пример цепочки в LangChain __________ """
# Пример цепочки в LangChain --> Решение: Slide 19, Video 5, 12:00.
# File on GitHub: https://github.com/viacheslav-bandylo/llm-course/blob/main/lesson-ai-05/ai5-1.py


"""" %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%_____________   LangChain:       ____________%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% 
                                       Интеграция с внешними источниками данных                                    """

""" __________ Примеры использования Document Loaders с векторным хранилищем __________ """

# Установить модуль:
# pip install PyPDF

#  --> Решение: Slide 32, Video 5, 46:00.
# File on GitHub: https://github.com/viacheslav-bandylo/llm-course/blob/main/lesson-ai-05/ai5-2.py

# asyncio - Модуль для работы с асинхронным программированием.
# Асинхронное программирование - распараллеливание кода, те выполнение кода по частям и параллельно.





""" ___________________________________  Review of previously covered material  ___________________________________ """
"""" %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%___________   ---   __________%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% """
""" __________ --- __________ """
""" __________ --- __________ """
#       ●
# ___ EXAMPLE __________________________________________________
# ___ END of Example __________________________________________________


""" ______  Task 1  ______________________________________________________________________________________________ """
#


