# Müller Alexader
# \033[0;__;__m \033[m   or   \033[1;__;__m \033[m
# print('#' * 115)      # Для разделения блоков на листе с кодом:
""" ################################################################################################################
 16.05.25
 AI  &  Python 03:  ____________.
 ################################################################################################################### """

# Video Lesson 03: ------------.
# Video Practice __: wasn't.
# links:
#   - Presentation:
#   - Облегчаем себе жизнь с помощью BeautifulSoup4: https://habr.com/ru/articles/544828/
#   - Устанавливаем python-пакеты с помощью pip: https://pythonworld.ru/osnovy/pip.html
#
# def input_numb_list():
#     numb_list = [int(x) for x in input('Enter a list of numbers separated by space: ').split()]
#     return numb_list
# ------------------------ SHORTCUTS ------------------------
# Ctrl + W - выделить текущий блок. если нажимать это сочетание дальше, то будут выделяться родительские блоки.
# Ctrl+Y - Удаление всей строки. Кстати, команда копирования Ctrl+C без выделения также работает для всей строки.
# Ctrl+Akt+L / Alt+Enter - Привести код к принятым стандартам (для Python - PEP8).
# Ctrl+R — Изменить название класса/функции и т. п. по всему проекту.
# Ctrl+Shift + F - Найти по всем файлам.
# Shift + F6 - заменить имя элемента во всех частях во всех файлах.
# -----------------------------------------------------------

print('.' * 80)


"""" %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%___________   GEMINI API Key   __________%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% """

# ++++++++++++++++++++++++
from google import genai
import os
# ++++++++++++++++++++++++

#  Код для запроса к API

# Загрузка API-ключа из переменной окружения
api_key = os.getenv("GEMINI_API_KEY")
# Создание клиента API
client = genai.Client(api_key=api_key)

# Отправка запроса к модели
response = client.models.generate_content(
    model="gemini-2.0-flash",
    contents=["Hi Gemini :) I'm glad to see here )"]
    # contents=["Say hello world."]
    # contents=["How does AI work?"]
    )
# Вывод ответа
print(response.text)

# Для работы в консоли:
# export GEMINI_API_KEY='ВАШ АПИ КЛЮЧ'  --- для Линукса.
# $env:GEMINI_API_KEY --- для Виндовс.

# Проверить наличие ключа:
# echo $env:GEMINI_API_KEY -- для Винды.

""" __ NB! __  Запускать только из КОНСОЛИ!  """
# Для запуска в консоли: Lessons/les03_16_05-Token.py

# Процедура выхода из ВИРТ ОКРУЖЕНИЯ и создания НОВОГО:
# Teacher 23 Teacher 23 12:07
# python3 -m venv myvenv        # Для создания нового вирт окружения в Линукусе.
# . myvenv/bin/activate             # Для активации нового вирт окружения в Линукусе.
# source myvenv/bin/activate        # ИЛИ можно активировать так в Линукусе.
# Теперь можно экспортировать СНОВА или ЗАНОВО ключ GEMINI_API_KEY='ВАШ_КЛЮЧ'.
# И запусить проект / файл в консоли по команде  python main.py.








""" ___________________________________  Review of previously covered material  ___________________________________ """


""" ______  Task 1  _______________________________________________________________________________________________ """
#


"""" %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%___________   ---   __________%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% """

""" __________ --- __________ """

""" __________ --- __________ """
#       ●
# ___ EXAMPLE __________________________________________________
# ___ END of Example __________________________________________________


""" ______  Task 1  ______________________________________________________________________________________________ """
#



