# Müller Alexader
# \033[0;__;__m \033[m   or   \033[1;__;__m \033[m
# print('#' * 115)      # Для разделения блоков на листе с кодом:
""" ################################################################################################################
 23.05.25
 AI  &  Python 04:  Обработка запросов и таймаутов. Эмбеддинги и векторные представления.
 ################################################################################################################### """

# ------------------------ SHORTCUTS ------------------------
# Ctrl + W - выделить текущий блок. если нажимать это сочетание дальше, то будут выделяться родительские блоки.
# Ctrl+Y - Удаление всей строки. Кстати, команда копирования Ctrl+C без выделения также работает для всей строки.
# Ctrl+Akt+L / Alt+Enter - Привести код к принятым стандартам (для Python - PEP8).
# Ctrl+R — Изменить название класса/функции и т. п. по всему проекту.
# Ctrl+Shift + F - Найти по всем файлам.
# Shift + F6 - заменить имя элемента во всех частях во всех файлах.
# -----------------------------------------------------------

print('.' * 80)

""" ______  Task 1  ______________________________________________________________________________________________ """
# Обязательно к выполнению.
#   1) Добавить защиту от блокировки API (Rate Limits).
#   2) Обработать таймауты.
#   3) Реализовать retry-механизм с tenacity.




""" ______  Task 2  ______________________________________________________________________________________________ """
# Дополнительно (по желанию).
#   1) Получить эмбеддинги двух разных текстов и сравнить их.
#   2) Реализовать простой поиск похожих текстов.




